---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyNestedLinks
source: html/f513cdcb-6b7c-81e3-d562-20c5fd665ba5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyNestedLinks Property

To copy a nested link, use Copy to Clipboard or Move Copy.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyNestedLinks { get; }
```